Revit 2027 API
ContinuousRail.GetSupports Method
 Returns all the railing supports attached to the rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetSupports()
Public Function GetSupports As IList(Of ElementId)
public:
IList<ElementId^>^ GetSupports()
member GetSupports : unit -> IList<ElementId>
Return Value
IList<ElementId>
See Also
Reference
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace